henji-Guo/LAUNCHXL-F280049C/test/boostxl_3phganinv2_test.c
/****************** BOOSTXL-3PhGaNInv *******************
# J8  80      GPIO0       EPWM1A
# J8  79      GPIO1       EPWM1B
# J8  78      GPIO6       EPWM4A
# J8  77      GPIO7       EPWM4B
# J8  76      GPIO2       EPWM2A
# J8  75      GPIO3       EPWM2B
# 
# J8  74      GPIO26      Over Temperature (Input LOW LEVEL Effective)
# 
# J6  53      GPIO33      PWM_ENABLE  (Output LOW LEVEL Effective)
# 
# J5  46      ADCINA4     VREF (about 3.3V)
# 
# J7  63      ADCINA6     Udc             SOC6
# J7  64      ADCINB6     UA              SOC5
# J7  65      ADCINC14    UB              SOC7
# J7  66      ADCINC1     UC              SOC8
# J7  67      ADCINC3     Ia              SOC5
# J7  68      ADCINC5     Ib              SOC6
# J7  69      ADCINA3     Ic              SOC5
# J7  70      ADCINA0     DACA_OUT
# 
# The Udc that VBUS Sense :
#     Udc_sensor = 4.22K / (4.22K + 100K) * VBUS 
# The VBUS 80V (abs max) scaled to 3.3V.
# So that Udc_sensor can equal :
#     Udc_sensor = ADC_SAMPLE_VAL / 4095.0f * 80.0f
# 
# Note that the motor three phase(UA/B/C) is same with Udc calculation. 
# 
# R_sample = 0.005 Ohm.
# 
# the current sample chip is INA240A1PW that Gain 20 and support PWM rejection.
# 
# Precision in-line phase current sensing wih 5-mohm shunt,
# for theoretical ± 16.5A full scale range),and ± 10.5A peak
# nominal range for the BOOSTXL-3PhGaNInv.
# 
# the offset Voltage is half of VREF(3.3V).
# 
#     result = 20 * ( V+ - V-) + 1.65
# 
#     Isen = ADC_SAMPLE_VAL / 4095.0f * 33 - 16.5
# 
****************** BOOSTXL-3PhGaNInv *******************/


/* #################### Include File #################### */
#include "test.h"
#include "device.h"
#include "driverlib.h"
#include "f28004x_device.h"
#include <math.h>
#include <stdio.h>
#include "foc.h"
#include "vofa.h"

/* #################### User Define #################### */
/* Over Temperature PIN */
#define OT_PIN      26
/* PWM_ENABLE PIN */
#define nEnable     33

/* ADC Sample-Hold time */
#define ADC_SAMPLE_WINDOWS  11  // 11*SYS_CLK ns

/* ADC value scaling */
#define ADC_VOLTAGE_SCALE       81.5f
#define ADC_CURRENT_SCALE       33.0f
#define ADC_CURRENT_OFFSET      16.5f

/* PWM period calculate */
#define EPWM_CLK            100000000U  // 100MHz
#define USER_CONTROL_FREQ   8000U   // 8KHz
#define EPWM_PERIOD         ( 0.5 * EPWM_CLK / USER_CONTROL_FREQ)

/**
 * % 直流母线电压
 * Udc = 320
 * % PWM开关频率
 * Tpwm = 1/10000
 * % 电机参数
 * % 磁极对数(Permanent magnet pole pairs)
 * Motor.Pn = 4 % ploe pairs
 * % 永磁体磁链(permanent magnet flux linkage)
 * Motor.Flux= 0.175 % Wb
 * % 相电阻(Phase resistance)
 * Motor.Rs = 2.875 % Ohm
 * % dq轴电感(d and q axis inductances)
 * Motor.Ld = 8.5e-3 % Henry
 * Motor.Lq = 8.5e-3 % Henry
 * % 电机转矩(Electromagnetic torque)
 * Motor.Te = 6 % N·m
 * % 转动惯量(Motor inertia)
 * Motor.J = 0.003 % Kg.m^2
 * % 沾粘系数(Friction constant)
 * Motor.B = 0.008 % Kg.m^2/s
 * % 反电动势常数(Back-EMF constant)
 * Motor.Ke = Motor.Flux * (sqrt(3)*1000*Motor.Pn*2*pi) / 60 % Vpk_LL/krpm
 * % 转矩常数(Torque constant)
 * Motor.Kt = Motor.Flux * Motor.Pn * 3/2 % N·m/A 
 */
/* Motor Parameter */
#define MOTOR_Rs        0.5f   // motor phase resistance (Ohm)
#define MOTOR_Ld        0.0126f   // motor d axis inductances (Henry)
#define MOTOR_Lq        0.0126f   // motor q axis inductances (Henry)
#define MOTOR_Flux      0.0055f    // motor permanent magnet flux linkage (Wb)
#define MOTOR_Pn        6U      // motor Permanent magnet pole pairs (pole pairs)
#define MOTOR_Te        0.0f    // motor electromagnetic torque (N·m)
#define MOTOR_J         0.0f    // Motor inertia (Kg·m^2)
#define MOTOR_B         0.0f    // Motor friction constant (Kg·m^2/s)
#define MOTOR_Ke        MOTOR_Flux*(sqrtf(3)*1000U*MOTOR_Pn*2*M_PI)/60.0f  // Motor Back-EMF constant (Vpk_LL/krpm)
#define MOTOR_Kt        MOTOR_Flux*MOTOR_Pn*3/2.0f  // Motor torque constant (N·m/A)

/**
 * LED :
 *      LED_ON  GPIO LOW
 *      LED_OFF GPIO HIGH
 *      GPIO25  DRV8320RS Board LED(Yellow)
 *      GPIO23  LanunchPad Board LED5(Green)
 *      GPIO34  LanunchPad Board LED4(Red)
 */
typedef enum {
    LED_RED     =   23,
    LED_YELLOW  =   25,
    LED_GREEN   =   34
}BOARD_LED;
typedef enum {
    LED_ON      =   0,
    LED_OFF     =   1,
    LED_TOGGLE  =   2
}LED_STATUS;

/* vofa frame */
struct vofa vofa;

/* #################### Function Declaration #################### */
static void boostxl_3phganiv2_gpio_mux(void);
static void boostxl_3phganiv2_enable(void);
static void boostxl_3phganiv2_disable(void);

static void led_gpio_init(void);
static void led(BOARD_LED led,LED_STATUS status);

static void epwm_gpio_mux(void);
static void epwm_1_init(void);
static void epwm_4_init(void);
static void epwm_2_init(void);

static void analog_subsys_init(void);
static void adc_a_init(void);
static void adc_b_init(void);
static void adc_c_init(void);

static void i2c_gpio_mux(void);
static void i2c_a_init(void);
static float as5600_get_angle(void);

__interrupt static void XINT1_ISR(void);
__interrupt static void ADCC1_ISR(void);

/* #################### Function Definition #################### */
static void boostxl_3phganiv2_gpio_mux(void)
{
    /* GPIO33 PWM_ENABLE (LOW LEVEL Effective) */
    GPIO_setPinConfig(GPIO_33_GPIO33);
    GPIO_setQualificationMode(nEnable, GPIO_QUAL_SYNC);
    GPIO_setPadConfig(nEnable, GPIO_PIN_TYPE_PULLUP);
    GPIO_writePin(nEnable,1);
    GPIO_setDirectionMode(nEnable, GPIO_DIR_MODE_OUT);
    GPIO_setMasterCore(nEnable, GPIO_CORE_CPU1);

    /* GPIO26 Over Temperature (LOW LEVEL Effective) */
    GPIO_setPinConfig(GPIO_26_GPIO26);
    GPIO_setQualificationMode(OT_PIN, GPIO_QUAL_SYNC);
    GPIO_setPadConfig(OT_PIN, GPIO_PIN_TYPE_PULLUP);
    GPIO_setDirectionMode(OT_PIN, GPIO_DIR_MODE_IN);
    GPIO_setMasterCore(OT_PIN, GPIO_CORE_CPU1);

    SysCtl_delay(50);

    /* enable GPIO26 OT input interrupt */
    GPIO_setInterruptPin(OT_PIN,GPIO_INT_XINT1);
    GPIO_setInterruptType(GPIO_INT_XINT1,GPIO_INT_TYPE_FALLING_EDGE);
    GPIO_enableInterrupt(GPIO_INT_XINT1);

    /* register XINT1 interrupt function and enable in PIE */
    Interrupt_register(INT_XINT1,&XINT1_ISR);
    Interrupt_enable(INT_XINT1);
}

static void boostxl_3phganiv2_enable(void)
{
    GPIO_writePin(nEnable,0);
}

static void boostxl_3phganiv2_disable(void)
{
    GPIO_writePin(nEnable,1);
}

static void led_gpio_init(void)
{
    /**
     * LED5 Red:
     *      GPIO23 output,pullup and control by CPU1
     */
    GPIO_setPinConfig(GPIO_23_GPIO23);
    GPIO_setQualificationMode(23, GPIO_QUAL_SYNC);
    GPIO_setPadConfig(23, GPIO_PIN_TYPE_PULLUP);
    GPIO_setDirectionMode(23, GPIO_DIR_MODE_OUT);
    GPIO_setMasterCore(23, GPIO_CORE_CPU1);
    GPIO_writePin(23,1);

    /**
     * LED4 Green:
     *      GPIO34 output,pullup and control by CPU1
     */
    GPIO_setPinConfig(GPIO_34_GPIO34);
    GPIO_setQualificationMode(34, GPIO_QUAL_SYNC);
    GPIO_setPadConfig(34, GPIO_PIN_TYPE_PULLUP);
    GPIO_setDirectionMode(34, GPIO_DIR_MODE_OUT);
    GPIO_setMasterCore(34, GPIO_CORE_CPU1);
    GPIO_writePin(34,1);

    /**
     * LED YELLOW:
     *      GPIO25 output,pullup and control by CPU1
     */
    GPIO_setPinConfig(GPIO_25_GPIO25);
    GPIO_setQualificationMode(25, GPIO_QUAL_SYNC);
    GPIO_setPadConfig(25, GPIO_PIN_TYPE_PULLUP);
    GPIO_setDirectionMode(25, GPIO_DIR_MODE_OUT);
    GPIO_setMasterCore(25, GPIO_CORE_CPU1);
    GPIO_writePin(25,1);
}

static void led(BOARD_LED led,LED_STATUS status)
{
    switch (status) {
        case LED_ON: 
            GPIO_writePin(led,LED_ON);
            break;
        case LED_OFF: 
            GPIO_writePin(led,LED_OFF);
            break;
        case LED_TOGGLE: 
            GPIO_togglePin(led);
            break;
        default:
            break;
    }
}

