henji-Guo/LAUNCHXL-F280049C/test/boostxl_3phganinv2_test.c
static void analog_subsys_init(void)
{
    /**
     * analog subsystem init:
     *      using internal voltage reference 3.3V(2*1.65)
     */
    SysCtl_delay(50);
    ASysCtl_setAnalogReferenceInternal(ASYSCTL_VREFHIA | ASYSCTL_VREFHIB | ASYSCTL_VREFHIC);
    ASysCtl_setAnalogReference1P65(ASYSCTL_VREFHIA | ASYSCTL_VREFHIB | ASYSCTL_VREFHIC);
    SysCtl_delay(50);
}

static void adc_a_init(void)
{
    /**
     *  ADCA：ADC_CLK 50MHz, 3.3V reference voltage, Acquisition window duration at least 75ns (8*SYS_CLK)
     *      name |      input pin     | soc number | trigger source | interrupt number |
     * J7_63 Udc |       ADCINA6      |    SOC 6   |   EPWM1_SOCA   |
     * J7_69 Ic  |       ADCINA3      |    SOC 5   |   EPWM1_SOCA   |
     */
    /* reset */
    SysCtl_resetPeripheral(SYSCTL_PERIPH_RES_ADCA);

    /* disable */
    ADC_disableConverter(ADCA_BASE);

    /* set ADC voltage reference internal 3.3V*/
    ADC_setVREF(ADCA_BASE, ADC_REFERENCE_INTERNAL, ADC_REFERENCE_3_3V);

    /* set prescaler ADC_CLK = 100MHz/2 =50MHz */
    ADC_setPrescaler(ADCA_BASE, ADC_CLK_DIV_2_0);

    /* set the timing of the end-of-conversion pulse */
    ADC_setInterruptPulseMode(ADCA_BASE, ADC_PULSE_END_OF_CONV);

    /* set soc number priority */
    ADC_setSOCPriority(ADCA_BASE,ADC_PRI_ALL_HIPRI);

    /* ADCINA6 SOC6, no interrupt trigger */
    ADC_setupSOC(ADCA_BASE, ADC_SOC_NUMBER6, ADC_TRIGGER_EPWM1_SOCA, ADC_CH_ADCIN6, ADC_SAMPLE_WINDOWS);
    ADC_setInterruptSOCTrigger(ADCA_BASE, ADC_SOC_NUMBER6, ADC_INT_SOC_TRIGGER_NONE);

    /* ADCINA3 SOC5, no interrupt trigger */
    ADC_setupSOC(ADCA_BASE, ADC_SOC_NUMBER5, ADC_TRIGGER_EPWM1_SOCA, ADC_CH_ADCIN3, ADC_SAMPLE_WINDOWS);
    ADC_setInterruptSOCTrigger(ADCA_BASE, ADC_SOC_NUMBER5, ADC_INT_SOC_TRIGGER_NONE);

    /* enable */
    ADC_enableConverter(ADCA_BASE);

    /* delay 5ms power up*/
    DEVICE_DELAY_US(5000);
}

static void adc_b_init(void)
{
    /**
     *  ADCB：ADC_CLK 50MHz, 3.3V reference voltage, Acquisition window duration at least 75ns (8*SYS_CLK)
     *      name |      input pin     | soc number | trigger source | interrupt number |
     * J7_64 Ua  |       ADCINB6      |    SOC 5   |   EPWM1_SOCA   |
     */
    /* reset */
    SysCtl_resetPeripheral(SYSCTL_PERIPH_RES_ADCC);

    /* disable */
    ADC_disableConverter(ADCB_BASE);

    /* set ADC voltage reference internal 3.3V*/
    ADC_setVREF(ADCB_BASE, ADC_REFERENCE_INTERNAL, ADC_REFERENCE_3_3V);

    /* set prescaler ADC_CLK = 100MHz/2 =50MHz */
    ADC_setPrescaler(ADCB_BASE, ADC_CLK_DIV_2_0);

    /* set the timing of the end-of-conversion pulse */
    ADC_setInterruptPulseMode(ADCB_BASE, ADC_PULSE_END_OF_CONV);

    /* set soc number priority */
    ADC_setSOCPriority(ADCB_BASE,ADC_PRI_ALL_HIPRI);

    /* ADCINB6  SOC5, no interrupt trigger */
    ADC_setupSOC(ADCB_BASE, ADC_SOC_NUMBER5, ADC_TRIGGER_EPWM1_SOCA, ADC_CH_ADCIN6, ADC_SAMPLE_WINDOWS);
    ADC_setInterruptSOCTrigger(ADCB_BASE, ADC_SOC_NUMBER5, ADC_INT_SOC_TRIGGER_NONE);

    /* enable */
    ADC_enableConverter(ADCB_BASE);

    /* delay 5ms power up*/
    DEVICE_DELAY_US(5000);
}

static void adc_c_init(void)
{
    /**
     *  ADCC：ADC_CLK 50MHz, 3.3V reference voltage, Acquisition window duration at least 75ns (8*SYS_CLK)
     *      name |      input pin     | soc number | trigger source | interrupt number |
     * J7_65 Ub  |       ADCINC14     |    SOC 7   |   EPWM6_SOCA   |
     * J7_66 Uc  |       ADCINC1      |    SOC 8   |   EPWM6_SOCA   |
     * J7_67 Ia  |       ADCINC3      |    SOC 5   |   EPWM6_SOCA   |
     * J7_68 Ib  |       ADCINC5      |    SOC 6   |   EPWM6_SOCA   |
     */
    /* reset */
    SysCtl_resetPeripheral(SYSCTL_PERIPH_RES_ADCC);

    /* disable */
    ADC_disableConverter(ADCC_BASE);

    /* set ADC voltage reference internal 3.3V*/
    ADC_setVREF(ADCC_BASE, ADC_REFERENCE_INTERNAL, ADC_REFERENCE_3_3V);

    /* set prescaler ADC_CLK = 100MHz/2 =50MHz */
    ADC_setPrescaler(ADCC_BASE, ADC_CLK_DIV_2_0);

    /* set the timing of the end-of-conversion pulse */
    ADC_setInterruptPulseMode(ADCC_BASE, ADC_PULSE_END_OF_CONV);

    /* set soc number priority */
    ADC_setSOCPriority(ADCC_BASE,ADC_PRI_ALL_HIPRI);

    /* ADCINC3 SOC5, no interrupt trigger */
    ADC_setupSOC(ADCC_BASE, ADC_SOC_NUMBER5, ADC_TRIGGER_EPWM1_SOCA, ADC_CH_ADCIN3, ADC_SAMPLE_WINDOWS);
    ADC_setInterruptSOCTrigger(ADCC_BASE, ADC_SOC_NUMBER5, ADC_INT_SOC_TRIGGER_NONE);

    /* ADCINC5 SOC6, no interrupt trigger */
    ADC_setupSOC(ADCC_BASE, ADC_SOC_NUMBER6, ADC_TRIGGER_EPWM1_SOCA, ADC_CH_ADCIN5, ADC_SAMPLE_WINDOWS);
    ADC_setInterruptSOCTrigger(ADCC_BASE, ADC_SOC_NUMBER6, ADC_INT_SOC_TRIGGER_NONE);

    /* ADCINC14 SOC7, no interrupt trigger */
    ADC_setupSOC(ADCC_BASE, ADC_SOC_NUMBER7, ADC_TRIGGER_EPWM1_SOCA, ADC_CH_ADCIN14, ADC_SAMPLE_WINDOWS);
    ADC_setInterruptSOCTrigger(ADCC_BASE, ADC_SOC_NUMBER7, ADC_INT_SOC_TRIGGER_NONE);

    /* ADCINC1 SOC8, no interrupt trigger */
    ADC_setupSOC(ADCC_BASE, ADC_SOC_NUMBER8, ADC_TRIGGER_EPWM1_SOCA, ADC_CH_ADCIN1, ADC_SAMPLE_WINDOWS);
    ADC_setInterruptSOCTrigger(ADCC_BASE, ADC_SOC_NUMBER8, ADC_INT_SOC_TRIGGER_NONE);

    /* set ADCC_SOC8 EOC using ADCC_INT1 */
    ADC_setInterruptSource(ADCC_BASE, ADC_INT_NUMBER1, ADC_SOC_NUMBER8);

    /* enable interrupt */
    ADC_enableInterrupt(ADCC_BASE, ADC_INT_NUMBER1);

    /* PieVectorTable register */
    Interrupt_register(INT_ADCC1,&ADCC1_ISR);

    /* PIE enable */
    Interrupt_enable(INT_ADCC1);

    /* enable */
    ADC_enableConverter(ADCC_BASE);

    /* delay 5ms power up*/
    DEVICE_DELAY_US(5000);
}

static void i2c_gpio_mux(void)
{
    /*
     *  I2CA GPIO MUX:
     *      GPIO35 --> I2C SDA  (pull up)
     *      GPIO37 --> I2C SCL  (pull up)
     *      Controller By CPU
     *      Asynchronization to SYSCLK
     */
    GPIO_setPinConfig(GPIO_35_I2CA_SDA);
    GPIO_setPadConfig(35, GPIO_PIN_TYPE_PULLUP);
    GPIO_setQualificationMode(35, GPIO_QUAL_ASYNC);
    GPIO_setMasterCore(35, GPIO_CORE_CPU1);

    GPIO_setPinConfig(GPIO_37_I2CA_SCL);
    GPIO_setPadConfig(37, GPIO_PIN_TYPE_PULLUP);
    GPIO_setQualificationMode(37, GPIO_QUAL_ASYNC);
    GPIO_setMasterCore(37, GPIO_CORE_CPU1);
}

static void i2c_a_init(void)
{
    /**
     *  I2CA:
     *      I2CA_CLK: 1MHz
     *      slaver address: 0x36
     *      transfer bit width: 8 bit
     */
    /* reset */
    SysCtl_resetPeripheral(SYSCTL_PERIPH_RES_I2CA);

    /* disable */
    I2C_disableModule(I2CA_BASE);

    /* I2C_CLK 1MHz , Clock reference "TRM 24.1.5 Clock Generation" */
    /* configure I2C Module clock using I2CPSC register I2C Module clock should be 7-12Mhz */
    I2caRegs.I2CPSC.bit.IPSC = 4U;   // I2C_Module_CLK(Fmod) = 100MHz SYSCLK / (ISP = 9 + 1) = 10Mhz
    
    /* configure I2C Baud rate using I2CCLKL and I2CCLKH */
    /* I2C Baud rate = ((I2CCLKL + d)+(I2CCLKH + d))/Fmod = ((5+5)+(5+5))/10MHz = 1/1MHz */
    I2caRegs.I2CCLKL = 5U;
    I2caRegs.I2CCLKH = 5U;
    
    /* config master send mode */
    I2C_setConfig(I2CA_BASE, I2C_CONTROLLER_SEND_MODE);

    /* set slaver address 0x36 */
    I2C_setTargetAddress(I2CA_BASE, 0x36U);

