henji-Guo/LAUNCHXL-F280049C/test/boostxl_3phganinv2_test.c
    /* disable loop back mode */
    I2C_disableLoopback(I2CA_BASE);

    /* set bit width 8 bits */
    I2C_setBitCount(I2CA_BASE, I2C_BITCOUNT_8);

    /* set slaver address mode 7 bits address */
    I2C_setAddressMode(I2CA_BASE, I2C_ADDR_MODE_7BITS);

    /* enable FIFO */
    I2C_enableFIFO(I2CA_BASE);

    /* set emulation mode */
    I2C_setEmulationMode(I2CA_BASE, I2C_EMULATION_FREE_RUN);

    /* enable */
    I2C_enableModule(I2CA_BASE);
}

static float as5600_get_angle(void)
{
    // note that this function need cost 54us

    /* temporary variable */
    uint16_t angle[2];

    /* I2C Master TX/RX Flowchat */
    /* I2C Basic configuration */

    // disable I2C ISR=0
    I2caRegs.I2CMDR.bit.IRS = 0;

    // Clock reference "TRM 24.1.5 Clock Generation"
    // Configure I2C Module clock using I2CPSC register I2C Module clock should be 7-12Mhz
    I2caRegs.I2CPSC.bit.IPSC = 4;  // I2C_Module_CLK(Fmod) = 100MHz SYSCLK / (ISP=4 + 1) = 20Mhz

    // Configure I2C Baud rate using I2CCLKL and I2CCLKH
    // I2C Baud rate = (I2CCLKL + d)+(I2CCLKH + d)/Fmod
    I2caRegs.I2CCLKL = 5;
    I2caRegs.I2CCLKH = 5;

    // Configure I2C Own address using I2COAR (no need in master tx/rx mode)
    I2caRegs.I2COAR.bit.OAR = 0x00;

    // Configure I2C Slave address to talk to using I2CSAR
    I2caRegs.I2CSAR.bit.SAR = 0x36;
    /* FIFO mode (16-deep x 8-bit FIFO) */
    /* enable and configure TX/RX FIFO,configure TX/RX FIFO level,if need can enable FIFO interrupts*/
    I2caRegs.I2CFFTX.bit.I2CFFEN = 0x1;
    I2caRegs.I2CFFTX.bit.TXFFRST = 0x1;
    I2caRegs.I2CFFTX.bit.TXFFIL = 0x0;
//    I2caRegs.I2CFFTX.bit.TXFFIENA = 0x1;
    I2caRegs.I2CFFRX.bit.RXFFRST = 0x1;
    I2caRegs.I2CFFRX.bit.RXFFIL = 0x2;
//    I2caRegs.I2CFFRX.bit.RXFFIENA = 0x1;

    /* Application code decides to initiate i2c transaction */
    /* check I2C bus free I2CSTR.BB == 0 */
    while(I2caRegs.I2CSTR.bit.BB);

    /* Master Transmitter MST=1 or Master Receive MST=0 */
    /* Master Transmitter MST=1 */ 
    I2caRegs.I2CMDR.bit.MST = 1;

    /* check Repeat mode RM=1 or No-repeat mode RM=0 */
    /* note that repeat mode don't care I2CNT */
    I2caRegs.I2CMDR.bit.RM = 0;

    /* No-repeat mode */
    /* set I2CCNT number of bytes to be transmitted */
    I2caRegs.I2CCNT = 1;

    /* set I2CMDR */
    I2caRegs.I2CMDR.all = 0x6620;

    /* put data in fifo */
    for (int i = 0; i < 1; i++) {
        /* check TX FIFO is full */
        while(I2caRegs.I2CFFTX.bit.TXFFST == 16);
        I2caRegs.I2CDXR.bit.DATA = 0x0C;
    }

    /* check i2c tx status */
    while(I2caRegs.I2CSTR.bit.XSMT != 1 || I2caRegs.I2CSTR.bit.BYTESENT != 1);
    I2caRegs.I2CSTR.bit.BYTESENT = 1;

    /* check I2CSTR ARDY bit */
    while(I2caRegs.I2CSTR.bit.ARDY != 1);
    I2caRegs.I2CSTR.bit.ARDY = 1;

    /* enter recieve mode */
    /* Master Receive MST=0 */ 
    I2caRegs.I2CMDR.bit.MST = 0;

    /* check Repeat mode RM=1 or No-repeat mode RM=0 */
    /* note that repeat mode don't care I2CNT */
    I2caRegs.I2CMDR.bit.RM = 0;

    /* No-repeat mode */
    /* set I2CCNT number of bytes to be recieved */
    I2caRegs.I2CCNT = 2;

    /* set I2CMDR */
    I2caRegs.I2CMDR.all = 0x6420; // TRM misdescription

    while(I2caRegs.I2CFFRX.bit.RXFFINT != 1);

    /* put data in fifo */
    for (int i = 0; i < 2; i++) {
        // check TX FIFO is full
        if(I2caRegs.I2CFFRX.bit.RXFFST > 0){
            angle[i] = I2caRegs.I2CDRR.all;
        }
    }

    /* check NACK */ 
    if(I2caRegs.I2CSTR.bit.NACKSNT != 1)
        I2caRegs.I2CMDR.bit.NACKMOD = 1;
    while(I2caRegs.I2CSTR.bit.NACKSNT != 1);
    I2caRegs.I2CSTR.bit.NACKSNT = 1;

    /* send stop */
    I2caRegs.I2CMDR.bit.STP = 1;
    
    /* calculate AS5600 raw value to angle(0,2PI) */
    return ( (angle[0] << 8 | angle[1]) / 4095.0f * 2.0f * M_PI );
}

// uint32_t cnt = 0;

__interrupt 
static void ADCC1_ISR(void)
{
    /* clear EPWM SOCA flag */
    EPWM_clearADCTriggerFlag(EPWM1_BASE,EPWM_SOC_A);
    /* clear ADCB INT1 flag */
    ADC_clearInterruptStatus(ADCC_BASE, ADC_INT_NUMBER1);
    /* clear PIE FLAG */
    Interrupt_clearACKGroup(INTERRUPT_ACK_GROUP1);

    // if (cnt++ < 5000){
    //     return;
    // }else{
    //     cnt = 0;
    // }

    /* get motor angle */
    foc_run(&foc_motor1);

#if 1
    vofa.setData(&vofa,foc_motor1.Iabc[0], 0);
    vofa.setData(&vofa,foc_motor1.Iabc[1], 1);
    vofa.setData(&vofa,foc_motor1.Iabc[2], 2);
    vofa.setData(&vofa,foc_motor1.Ialpha, 3);
    vofa.setData(&vofa,foc_motor1.Ibeta, 4);
    vofa.setData(&vofa,foc_motor1.Id, 5);
    vofa.setData(&vofa,foc_motor1.Id_ref, 6);
    vofa.setData(&vofa,foc_motor1.Udc, 7);
#elif 0
    vofa.setData(&vofa,foc_motor1.Tcm1, 0);
    vofa.setData(&vofa,foc_motor1.Tcm2, 1);
    vofa.setData(&vofa,foc_motor1.Tcm3, 2);
    vofa.setData(&vofa,foc_motor1.thetaELEC, 3);
    vofa.setData(&vofa,foc_motor1.Ualpha, 4);
    vofa.setData(&vofa,foc_motor1.Ubeta, 5);
    vofa.setData(&vofa,foc_motor1.Udc, 7);
#else
    vofa.setData(&vofa,foc_motor1.Id_ref, 0);
    vofa.setData(&vofa,foc_motor1.Id, 1);
    vofa.setData(&vofa,foc_motor1.Id_error, 2);
    vofa.setData(&vofa,foc_motor1.Ualpha, 3);
    vofa.setData(&vofa,foc_motor1.Ubeta, 4);
    vofa.setData(&vofa,foc_motor1.Ud, 5);
    vofa.setData(&vofa,foc_motor1.Uq, 6);
#endif
    vofa.print(&vofa);


}

__interrupt
static void XINT1_ISR(void)
{
    if(GPIO_readPin(OT_PIN) == 0){
        boostxl_3phganiv2_disable();
        led(LED_RED,LED_ON);
        while(1);
    }
    /* clear PIE FLAG */
    Interrupt_clearACKGroup(INTERRUPT_ACK_GROUP1);
}

void boostxl_3phganinv2_test(void)
{
    /* GPIO MUX */
    boostxl_3phganiv2_gpio_mux();
    led_gpio_init();

    /* ANALOG SUBSYS Init*/
    analog_subsys_init();

    /* ADC Init */
    adc_a_init();
    adc_b_init();
    adc_c_init();

    /* I2C Init */
    i2c_gpio_mux();
    i2c_a_init();

    /* FOC Init */
    foc_init(&foc_motor1);

    /* VOFA+ Init */
    vofa_init(&vofa);

    /* enable boostxl-3phganiv2 */
    boostxl_3phganiv2_enable();

    /* EPWM Init */
    /* Must disable the clock to the ePWM modules to have all ePWM modules synchronized */
    SysCtl_disablePeripheral(SYSCTL_PERIPH_CLK_TBCLKSYNC);
    /* EPWM1/4/2 GPIO MUX Init */
    epwm_gpio_mux();
    /* EPWM1/4/2 Init */
    epwm_1_init();
    epwm_4_init();
    epwm_2_init();
    /* TBCLK to ePWM modules enabled */
    SysCtl_enablePeripheral(SYSCTL_PERIPH_CLK_TBCLKSYNC);

    while (1){
        // DEVICE_DELAY_US(500000);
    }
    
