henji-Guo/LAUNCHXL-F280049C/test/boostxl_3phganinv2_test.c
}

/**
 * @brief Set PWM Duty
 *
 * @param Ua Set A phase PWM duty
 * @param Ub Set B phase PWM duty
 * @param Uc Set C phase PWM duty
 */
void svpwm_setDuty(struct foc* foc_handle)
{
    uint16_t period = foc_handle->pwm_period;
    pwm_setDuty(foc_handle->Tcm1 * period,
                foc_handle->Tcm2 * period,
                foc_handle->Tcm3 * period);
}

/**
 * @brief Get the motor mechanical radian angle
 *
 * @param foc_handle
 */
void get_RadianAngle(struct foc* foc_handle)
{
#if 0
    foc_handle->thetaELEC += 2.0 * M_PI * 125e-6 * foc_handle->motorFreq;
    foc_handle->thetaELEC = fmodf(foc_handle->thetaELEC,2 * M_PI);
#else 
    //  foc_handle->thetaMECH = as5600_get_angle();
    //  foc_handle->thetaELEC = foc_handle->thetaMECH * foc_handle->motorPoles;
    //  foc_handle->thetaELEC = fmodf(foc_handle->thetaELEC, 2 * M_PI);
    // foc_handle->thetaELEC += M_PI/6;
    // foc_handle->thetaELEC = fmodf(foc_handle->thetaELEC,2*M_PI);
#endif
}

/**
 * @brief Get the motor three phase current Iabc
 *
 * @param foc_handle pointer to foc component handler
 */
void get_current_Iabc(struct foc* foc_handle)
{
    /* Ia Ib Ic */
    foc_handle->Iabc[0] = ADC_readResult(ADCCRESULT_BASE, ADC_SOC_NUMBER5) / 4095.0f * ADC_CURRENT_SCALE - ADC_CURRENT_OFFSET;
    foc_handle->Iabc[1] = ADC_readResult(ADCCRESULT_BASE, ADC_SOC_NUMBER6) / 4095.0f * ADC_CURRENT_SCALE - ADC_CURRENT_OFFSET;
    foc_handle->Iabc[2] = ADC_readResult(ADCARESULT_BASE, ADC_SOC_NUMBER5) / 4095.0f * ADC_CURRENT_SCALE - ADC_CURRENT_OFFSET;
}

/**
 * @brief Get the motor three phase voltage Uabc
 *
 * @param foc_handle pointer to foc component handler
 */
void get_voltage_Uabc(struct foc* foc_handle)
{
    /* Ua Ub Uc Udc */
    foc_handle->Uabc[0] = ADC_readResult(ADCBRESULT_BASE, ADC_SOC_NUMBER5) / 4095.0f * ADC_VOLTAGE_SCALE;
    foc_handle->Uabc[1] = ADC_readResult(ADCCRESULT_BASE, ADC_SOC_NUMBER7) / 4095.0f * ADC_VOLTAGE_SCALE;
    foc_handle->Uabc[2] = ADC_readResult(ADCCRESULT_BASE, ADC_SOC_NUMBER8) / 4095.0f * ADC_VOLTAGE_SCALE;
    foc_handle->Udc     = ADC_readResult(ADCARESULT_BASE, ADC_SOC_NUMBER6) / 4095.0f * ADC_VOLTAGE_SCALE;
}

/**
 * @brief Get the motor rotation Speed
 *
 * @param foc_handle pointer to foc component handler
 */
void get_motorSpeed(struct foc* foc_handle)
{
    //TODO
}

/**
 * @brief Vofa Print Data Message
 * 
 */
void vofa_print(struct vofa* vofa)
{
    uint16_t *tx_buf = (uint16_t*)&vofa->frame;
    int i,timeCnt;
    for (i = 0; i < VOFA_CH_COUNT * 2; i++){
        while(SciaRegs.SCIFFTX.bit.TXFFST >= 14 && timeCnt++ < 1000);
        if(timeCnt > 1000)
            return;
        SciaRegs.SCITXBUF.bit.TXDT = tx_buf[i];
        SciaRegs.SCITXBUF.bit.TXDT = tx_buf[i] >> 8;
    }
    while(SciaRegs.SCIFFTX.bit.TXFFST >= 12 && timeCnt++ < 1000);
        if(timeCnt > 1000)
            return;
    SciaRegs.SCITXBUF.bit.TXDT = (uint16_t)vofa->frame.tail[0];
    SciaRegs.SCITXBUF.bit.TXDT = (uint16_t)vofa->frame.tail[1];
    SciaRegs.SCITXBUF.bit.TXDT = (uint16_t)vofa->frame.tail[2];
    SciaRegs.SCITXBUF.bit.TXDT = (uint16_t)vofa->frame.tail[3];
}
